### TF Service changes
```
[command]/home/runner/work/_temp/834d2bfa-47e0-4fba-ad78-e76f19ea5879/terraform-bin -chdir=.devops/terraform/ecs show -no-color plan.out

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs_service.data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                  = (known after apply)
      + arn_without_revision = (known after apply)
      + execution_role_arn   = (known after apply)
      + family               = (known after apply)
      + id                   = (known after apply)
      + network_mode         = (known after apply)
      + revision             = (known after apply)
      + status               = (known after apply)
      + task_definition      = "store-dev"
      + task_role_arn        = (known after apply)
    }

  # module.ecs_service.aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:390844774324:service/ecs-cluster-external-dev/store-dev"
        name                               = "store-dev"
        tags                               = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
      ~ task_definition                    = "store-dev:35" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:390844774324:task-definition/store-dev:35" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:390844774324:task-definition/store-dev" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "390844774324.dkr.ecr.eu-west-1.amazonaws.com/flip-out-store-dev:flp-web-1.0.66-8257d" -> ""
                    name                   = "store-dev"
                    # (18 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "store-dev" -> (known after apply)
      ~ revision                 = 35 -> (known after apply)
        tags                     = {
            "Environment" = "dev"
            "Terraform"   = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A+/- create replacement and then destroy%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs_service.data.aws_ecs_task_definition.this[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_ecs_task_definition" "this" {%0A      + arn                  = (known after apply)%0A      + arn_without_revision = (known after apply)%0A      + execution_role_arn   = (known after apply)%0A      + family               = (known after apply)%0A      + id                   = (known after apply)%0A      + network_mode         = (known after apply)%0A      + revision             = (known after apply)%0A      + status               = (known after apply)%0A      + task_definition      = "store-dev"%0A      + task_role_arn        = (known after apply)%0A    }%0A%0A  # module.ecs_service.aws_ecs_service.this[0] will be updated in-place%0A  ~ resource "aws_ecs_service" "this" {%0A        id                                 = "arn:aws:ecs:eu-west-1:390844774324:service/ecs-cluster-external-dev/store-dev"%0A        name                               = "store-dev"%0A        tags                               = {%0A            "Environment" = "dev"%0A            "Terraform"   = "true"%0A        }%0A      ~ task_definition                    = "store-dev:35" -> (known after apply)%0A        # (17 unchanged attributes hidden)%0A%0A        # (5 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs_service.aws_ecs_task_definition.this[0] must be replaced%0A+/- resource "aws_ecs_task_definition" "this" {%0A      ~ arn                      = "arn:aws:ecs:eu-west-1:390844774324:task-definition/store-dev:35" -> (known after apply)%0A      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:390844774324:task-definition/store-dev" -> (known after apply)%0A      ~ container_definitions    = jsonencode(%0A          ~ [%0A              ~ {%0A                  ~ image                  = "390844774324.dkr.ecr.eu-west-1.amazonaws.com/flip-out-store-dev:flp-web-1.0.66-8257d" -> ""%0A                    name                   = "store-dev"%0A                    # (18 unchanged attributes hidden)%0A                },%0A            ] # forces replacement%0A        )%0A      ~ id                       = "store-dev" -> (known after apply)%0A      ~ revision                 = 35 -> (known after apply)%0A        tags                     = {%0A            "Environment" = "dev"%0A            "Terraform"   = "true"%0A        }%0A        # (12 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0APlan: 1 to add, 1 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```

<!-- Sticky Pull Request Commentterraform-service-plan -->